# напишите программу, в которой программа запрашивает
# у пользователя день и месяц, а затем выводит сообщение
# о текщем дне и месяце

day = int(input("Введите день "))
month = input("введите месяц ")
print("Сегодня "+str(day)+" "+month)